# AdditionalElementsRequiredRemove Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..AdditionalElementsRequiredRemove Property
BuiltInFailures..::..GroupFailures Class See Also
---
To be able to remove the selected elements from the group the following additional element(s) will also be removed: [Description]
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AdditionalElementsRequiredRemove { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AdditionalElementsRequiredRemove As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AdditionalElementsRequiredRemove {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace